from sqlalchemy import create_engine
from sqlalchemy.orm import DeclarativeBase, Session, sessionmaker


DATABASE_URL = "sqlite:///./kvitto.db" # адрес расположения таблицы


# DeclarativeBase - основа, нужная для создания моделей таблиц - (ORM-модель)
# ORM-модель - это реализованный класс, который описывает структуру таблицы, т.е. для создания таблиц
# используем create TABLE... в SQL-запросы, но благодаря ORM-модели мы за место запросов,
# можем работать с его классами и затем ORM преобразует то что мы сделаем в SQL-команды вида create TABLE....
# Т.е. мы как бы описывает, как выглядит таблица но её пока не создаём
class Base(DeclarativeBase):
    pass


# create_engine нужен для создания движка, указываем где он лежит(-ать) будет ставим возможность работы
# с бд через другой поток
engine = create_engine(
    DATABASE_URL,
    connect_args={"check_same_thread": False}, # в fastapi запросы могут обрабатываться в разных потоках, чтоб не
    # было ошибки из-за того что другой поток выполнил запрос а не тот через которым мы подключились. Т.е. по дефолту
    # он может работать только с тем потоком через который он был создан
)


# фабрика сессий - объект, который будет создавать настроенные сессии
SessionLocal = sessionmaker(
    bind=engine, # все сессии созданные этим объектом работают через движок который мы создали выше
    class_=Session,
    autocommit=False, # отключаем автоматическое изменение в бд, т.е. после добавления записи в бд нужно после
    # этого ещё совершить commit
    autoflush=False, # не делать flush - это настройка, которая нужна для того, чтоб когда мы делаем запрос к бд,
    # мы не видели новую строчку, которую мы хотим добавить до коммита в бд, т.е. мы её уже добавили в сессии, но она ещё
    # не видна, а станет видна только после коммита.
    # Т.е. она храниться в сессии, но не в бд
)


# функция для fastapi которая будет подключаться для получения сессии для работы с бд
def get_db():
    db = SessionLocal() # создаём сессию к бд
    try:
        yield db # передаём сессию fastapi для endpoint чтоб он мог с ним работать
    finally:
        db.close() # закрытие сессии