from fastapi import APIRouter, Depends
# APIRouter - нужен чтобы объединять связанные endpoints в отдельный роутер. Это нужно
# для того чтоб можно было по отдельным файлам создавать методы и не нагромождать в 1 файле всю логику бекенда
# Depends - нужен для зависимостей FastAPI, это означает, что перед выполнением функции вызвать
# получение ссылки на сессию т.е. мы её не создаём сессию, а также
# ждём когда произойдет и только потом выполняем функцию
from sqlalchemy import select
from sqlalchemy.orm import Session

from app.database.database import get_db
from app.database.models import Tariff
from app.schemas import TariffResponse


router = APIRouter(
    prefix="/tariffs", # префикс нужен, чтобы все эндпоинты которые тут лежат будут вызываться с префикса
    # это будет считаться как отдельная страница для какого-то функционала типо если игру делаем то
    # для 1 игры используется 1 префикс и у него уже свои методы вложенные в бекенде а если на сайте делаем
    # другую игру то у него уже будет свой префикс и свои эндпоинты по ним
    tags=["tariffs"], # теги нужны для документации /docs он нужен для группировки endpoint'ов
)


# response_model=list[TariffResponse] - нужен чтоб задать явно какой тип данных (схему ответа) мы вернём,
# если что-то другое ошибка и response_model означает, что SQLAlchemy-объекты полученные
# нужно представить клиенту как список TariffResponse.
# Без указания типа он бы всё равно сериализовал данные
# Сериализация - это взять объект/данные внутри Python и представить их в формате, который можно
# передать наружу - клиенту
@router.get("", response_model=list[TariffResponse])
def get_tariffs(db: Session = Depends(get_db)):
    tariffs = db.scalars(select(Tariff)).all() # Здесь мы получили тарифы в виде объектов класса Tariff
    return tariffs
    # сериализация происходит в fastapi выполняет обработку результата отправляемый
    # клиенту сервером, после return
    # и после сериализации клиент получается http-ответ